src/test/data/card-payment-with-exchange-rate.json

{
  "timestampAsInstant": 1768323242.769,
  "id": "d19384e9-fe39-5291-b17d-f0bf59a7efdd",
  "title": "TOKKI AND TORA",
  "subtitle": null,
  "timestamp": "2026-01-13T16:54:02.769+0000",
  "eventType": null,
  "amount": {
    "value": -115.87,
    "currency": "EUR"
  },
  "details": {
    "id": "d19384e9-fe39-5291-b17d-f0bf59a7efdd",
    "sections": [
      {
        "title": "Du hast 115,87 € ausgegeben",
        "data": {
          "icon": {
            "asset": "logos/merchant-fallback-restaurants/v2",
            "badge": null
          },
          "timestamp": "2026-01-13T16:54:03.646Z",
          "status": "executed"
        },
        "type": "header"
      },
      {
        "title": "Übersicht",
        "data": [
          {
            "title": "Kartenzahlung",
            "detail": {
              "text": "Fertig",
              "functionalStyle": "EXECUTED",
              "type": "status"
            },
            "style": "plain"
          },
          {
            "title": "Zahlung",
            "detail": {
              "text": "··0218",
              "icon": "logos/bank_traderepublic/v2",
              "type": "iconWithText"
            },
            "style": "plain"
          },
          {
            "title": "Händler",
            "detail": {
              "text": "TOKKI AND TORA",
              "displayValue": {
                "text": "TOKKI AND TORA"
              },
              "type": "text"
            },
            "style": "plain"
          },
          {
            "title": "Betrag",
            "detail": {
              "text": "12.132,00 ₹",
              "displayValue": {
                "text": "12.132,00 ₹"
              },
              "type": "text"
            },
            "style": "plain"
          },
          {
            "title": "Wechselkurs",
            "detail": {
              "text": "1 ₹ 0,009551 €",
              "displayValue": {
                "text": "0,009551 €",
                "prefix": "1 ₹"
              },
              "type": "text"
            },
            "style": "plain"
          },
          {
            "title": "Gesamt",
            "detail": {
              "text": "115,87 €",
              "displayValue": {
                "text": "115,87 €"
              },
              "type": "text"
            },
            "style": "plain"
          }
        ],
        "type": "table"
      },
      {
        "title": "Vorteile",
        "data": [
          {
            "title": "Allianz",
            "detail": {
              "title": "Allianz",
              "timestamp": "2026-01-13T16:54:03.987428Z",
              "amount": "1,15 €",
              "icon": {
                "asset": "logos/DE0008404005/v2",
                "badge": null
              },
              "status": "executed",
              "action": {
                "payload": {
                  "id": "ca801210-d4c1-4739-bd18-e914211eaf63",
                  "sections": [
                    {
                      "title": "Saveback",
                      "type": "title"
                    },
                    {
                      "data": [
                        {
                          "title": "Transaction",
                          "detail": {
                            "text": "115,87 €",
                            "displayValue": {
                              "text": "115,87 €"
                            },
                            "type": "text"
                          },
                          "style": "plain"
                        },
                        {
                          "title": "Saveback-Anteil",
                          "detail": {
                            "text": "1%",
                            "displayValue": {
                              "text": "1%"
                            },
                            "type": "text"
                          },
                          "style": "plain"
                        },
                        {
                          "title": "",
                          "detail": {
                            "content": {
                              "type": "default",
                              "title": "Saveback",
                              "truncate": false
                            },
                            "trailing": {
                              "type": "value",
                              "title": "1,1587 €"
                            },
                            "type": "listItem"
                          },
                          "style": "plain"
                        }
                      ],
                      "type": "table"
                    },
                    {
                      "text": "Du erhältst Saveback auf die ersten 1.500 € auf zulässige Zahlungen pro Monat. Erfahre mehr über Saveback.",
                      "style": "disclaimer",
                      "type": "text"
                    }
                  ]
                },
                "type": "infoPage"
              },
              "subtitle": "Saveback · 1%",
              "type": "embeddedTimelineItem"
            },
            "style": "plain"
          },
          {
            "title": "Allianz",
            "detail": {
              "title": "Allianz",
              "timestamp": "2026-01-13T16:54:04.004727Z",
              "amount": "0,13 €",
              "icon": {
                "asset": "logos/DE0008404005/v2",
                "badge": null
              },
              "status": "executed",
              "action": {
                "payload": {
                  "id": "6b92b5f0-2b26-4e7d-bd02-10dfbf830d29",
                  "sections": [
                    {
                      "title": "Round up",
                      "type": "title"
                    },
                    {
                      "data": [
                        {
                          "title": "Transaction",
                          "detail": {
                            "text": "115,87 €",
                            "displayValue": {
                              "text": "115,87 €"
                            },
                            "type": "text"
                          },
                          "style": "plain"
                        },
                        {
                          "title": "Aufgerundet",
                          "detail": {
                            "text": "116,00 €",
                            "displayValue": {
                              "text": "116,00 €"
                            },
                            "type": "text"
                          },
                          "style": "plain"
                        },
                        {
                          "title": "Wechselgeld",
                          "detail": {
                            "text": "1 × 0,13 €",
                            "displayValue": {
                              "text": "0,13 €",
                              "prefix": "1 ×"
                            },
                            "type": "text"
                          },
                          "style": "plain"
                        },
                        {
                          "title": "Round up",
                          "detail": {
                            "text": "0,13 €",
                            "displayValue": {
                              "text": "0,13 €"
                            },
                            "type": "text"
                          },
                          "style": "highlighted"
                        }
                      ],
                      "type": "table"
                    },
                    {
                      "text": "Erfahre mehr über Round up.",
                      "style": "disclaimer",
                      "type": "text"
                    }
                  ]
                },
                "type": "infoPage"
              },
              "subtitle": "Round up · 1×",
              "type": "embeddedTimelineItem"
            },
            "style": "plain"
          }
        ],
        "type": "table"
      },
      {
        "title": "Dokumente",
        "data": [
          {
            "title": "Transaktionsbeleg",
            "action": {
              "payload": "https://traderepublic-postbox-platform-production.s3.eu-central-1.amazonaws.com/timeline/postbox/2025/12/23/d5858c5c/pb176650722364416485359366268.pdf?X-Amz-Security-Token=void",
              "type": "browserModal"
            },
            "id": "d19384e9-fe39-5291-b17d-f0bf59a7efdd",
            "postboxType": ""
          }
        ],
        "type": "documents"
      },
      {
        "data": [
          {
            "title": "Problem melden",
            "detail": {
              "text": "",
              "action": {
                "payload": {
                  "id": "d19384e9-fe39-5291-b17d-f0bf59a7efdd",
                  "sections": [
                    {
                      "title": "Problem melden",
                      "type": "title"
                    },
                    {
                      "data": [
                        {
                          "title": "Diese Transaktion kommt mir nicht bekannt vor.",
                          "detail": {
                            "content": {
                              "type": "default",
                              "title": "Diese Transaktion kommt mir nicht bekannt vor.",
                              "truncate": false
                            },
                            "trailing": {
                              "type": "chevron"
                            },
                            "action": {
                              "payload": {
                                "transactionId": "d19384e9-fe39-5291-b17d-f0bf59a7efdd",
                                "timelineEventId": "d19384e9-fe39-5291-b17d-f0bf59a7efdd",
                                "timelineEventTypes": [
                                  "CARD_TRANSACTION",
                                  "CARD_ATM_WITHDRAWAL",
                                  "CARD_AFT",
                                  "CARD_CASH_BACK"
                                ],
                                "cashAnalyticsCategories": [],
                                "chatAction": {
                                  "payload": {
                                    "contextCategory": "NHC",
                                    "contextParams": {
                                      "chat_flow_key": "NHC_0034_card_report_fraud",
                                      "card-dispute-txId": "d19384e9-fe39-5291-b17d-f0bf59a7efdd"
                                    }
                                  },
                                  "type": "customerSupportChat"
                                }
                              },
                              "type": "fraudDisputeFlow"
                            },
                            "type": "listItem"
                          },
                          "style": "plain"
                        },
                        {
                          "title": "Ich habe nicht das bekommen, wofür ich bezahlt habe.",
                          "detail": {
                            "content": {
                              "type": "default",
                              "title": "Ich habe nicht das bekommen, wofür ich bezahlt habe.",
                              "truncate": false
                            },
                            "trailing": {
                              "type": "chevron"
                            },
                            "action": {
                              "payload": {
                                "type": "NON_ATM",
                                "transactionId": "d19384e9-fe39-5291-b17d-f0bf59a7efdd",
                                "timelineEventId": "d19384e9-fe39-5291-b17d-f0bf59a7efdd",
                                "contactDetailsQuery": "TOKKI+AND+TORA+Kontaktdaten",
                                "chatAction": {
                                  "payload": {
                                    "contextCategory": "NHC",
                                    "contextParams": {
                                      "chat_flow_key": "NHC_0034_card_report_not_satisfied",
                                      "card-dispute-txId": "d19384e9-fe39-5291-b17d-f0bf59a7efdd"
                                    }
                                  },
                                  "type": "customerSupportChat"
                                }
                              },
                              "type": "nonFraudDisputeFlow"
                            },
                            "type": "listItem"
                          },
                          "style": "plain"
                        },
                        {
                          "title": "Ein falscher Betrag wurde abgerechnet.",
                          "detail": {
                            "content": {
                              "type": "default",
                              "title": "Ein falscher Betrag wurde abgerechnet.",
                              "truncate": false
                            },
                            "trailing": {
                              "type": "chevron"
                            },
                            "action": {
                              "payload": {
                                "type": "NON_ATM",
                                "transactionId": "d19384e9-fe39-5291-b17d-f0bf59a7efdd",
                                "timelineEventId": "d19384e9-fe39-5291-b17d-f0bf59a7efdd",
                                "contactDetailsQuery": "TOKKI+AND+TORA+Kontaktdaten",
                                "chatAction": {
                                  "payload": {
                                    "contextCategory": "NHC",
                                    "contextParams": {
                                      "chat_flow_key": "NHC_0034_card_report_charged_incorrectly",
                                      "card-dispute-txId": "d19384e9-fe39-5291-b17d-f0bf59a7efdd"
                                    }
                                  },
                                  "type": "customerSupportChat"
                                }
                              },
                              "type": "nonFraudDisputeFlow"
                            },
                            "type": "listItem"
                          },
                          "style": "plain"
                        },
                        {
                          "title": "Etwas anderes",
                          "detail": {
                            "content": {
                              "type": "default",
                              "title": "Etwas anderes",
                              "truncate": false
                            },
                            "trailing": {
                              "type": "chevron"
                            },
                            "action": {
                              "payload": {
                                "contextCategory": "NHC",
                                "contextParams": {
                                  "chat_flow_key": "NHC_0034_card_tx_something_else",
                                  "card-dispute-txId": "d19384e9-fe39-5291-b17d-f0bf59a7efdd"
                                }
                              },
                              "type": "customerSupportChat"
                            },
                            "type": "listItem"
                          },
                          "style": "plain"
                        }
                      ],
                      "type": "table"
                    }
                  ]
                },
                "type": "infoPage"
              },
              "displayValue": {
                "text": ""
              },
              "type": "text"
            },
            "style": "plain"
          }
        ],
        "type": "table"
      }
    ]
  },
  "status": "EXECUTED"
}
